real_runs/a100_opt13b_offload_matrix/kv10/code/opt13b/gpu_a100/offload_code_30gib/logs/bench_client.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7602ad664ea0>, trust_remote_code=False, seed=0, num_prompts=22, dataset_name='custom', no_stream=False, dataset_path='/home/ubuntu/LLM/real_runs/datasets/opt13b_offload/code_22x1536.jsonl', no_oversample=True, skip_chat_template=True, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1536, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=18201, endpoint='/v1/completions', header=None, max_concurrency=22, model='facebook/opt-13b', input_len=None, output_len=None, tokenizer='facebook/opt-13b', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=['max_model_len=2048'], result_dir='/home/ubuntu/LLM/real_runs/a100_opt13b_offload_matrix/kv10/code/opt13b/gpu_a100/offload_code_30gib/results', result_filename='bench_serve.json', ignore_eos=True, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-7f1ef079-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='opt13b-gpu_a100', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
INFO 07-15 12:25:59 [datasets.py:309] Skipping oversampling. Total samples: 22.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 22
100%|██████████| 22/22 [01:29<00:00,  4.07s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     22        
Failed requests:                         0         
Maximum request concurrency:             22        
Benchmark duration (s):                  89.50     
Total input tokens:                      5522      
Total generated tokens:                  33792     
Request throughput (req/s):              0.25      
Output token throughput (tok/s):         377.57    
Peak output token throughput (tok/s):    880.00    
Peak concurrent requests:                22.00     
Total token throughput (tok/s):          439.27    
---------------Time to First Token----------------
Mean TTFT (ms):                          533.46    
Median TTFT (ms):                        604.66    
P99 TTFT (ms):                           803.02    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          42.27     
Median TPOT (ms):                        43.84     
P99 TPOT (ms):                           57.41     
---------------Inter-token Latency----------------
Mean ITL (ms):                           42.27     
Median ITL (ms):                         29.58     
P99 ITL (ms):                            39.27     
==================================================